
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Kei-14316/aws-ecs-terraform/actions/runs/5220236189)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05bde0a43cedd7f24]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e1444dc369c6cbad]
aws_security_group.ecs: Refreshing state... [id=sg-03b9fed5e00715fc7]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-01c3717c29829d9bf]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07608151bf33406ca]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0986b1495eb433f83]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:targetgroup/go-simple-server-target-group/cac4c5a941766467]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c0bc41ac623bf047]
aws_security_group.alb: Refreshing state... [id=sg-02656327184f70631]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e054ec1ea559de12]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cfa55090da32ceca]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02636a6065af32dde]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0963e4ab147c031f8]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cd0eae1be65cafc5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-046ad7df85107fcee]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-011fa2bf861254f7b]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09af46d018be55f0d]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3501366068]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:loadbalancer/app/go-simple-server-alb/5eaad2e6b2138475]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036b47fbbd9d112a6]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c777dfe8108bdfd2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b00027bee9458ab2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bc3d7f6dd6b2cae4]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-046ad7df85107fcee1080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f5ebd36b53770c66]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bc41aa383cb2c5e6]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c0bc41ac623bf0471080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0986b1495eb433f831080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:listener/app/go-simple-server-alb/5eaad2e6b2138475/6aa8f34524ef8443]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:listener-rule/app/go-simple-server-alb/5eaad2e6b2138475/6aa8f34524ef8443/ff5abd0b08871db4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"34bfc916419768d91a92a21a312d179a9c3e5a6f","Vars":{},"WorkflowName":"Terraform"} -->